app/Http/Controllers/AdminController.php

    public function index()
    {
    	$user = User::all()->count();
    	$product = Product::all()->count();
    	$terjual = Order::where('status','Di Terima')->count();
    	$pesanan = Order::where('status','Menunggu Persetujuan')->count();
        $order = Order::where('status','Menunggu Persetujuan')->get();
---
select count(*) as aggregate from `orders` where `status` = 'Di Terima'
select count(*) as aggregate from `orders` where `status` = 'Menunggu Persetujuan'
select * from `orders` where `status` = 'Menunggu Persetujuan'