app/Http/Controllers/HomeController.php

    public function index()
    {
        $category = Category::all();
        $product = DB::table('photos')
                    ->join('products','photos.product_id','=','products.id')
                    ->join('categories','products.category_id','=','categories.id')
                    ->select('categories.*','products.*','photos.*')
                    ->get();
---
select * from `categories`
select `categories`.*, `products`.*, `photos`.* from `photos` inner join `products` on `photos`.`product_id` = `products`.`id` inner join `categories` on `products`.`category_id` = `categories`.`id`