app/Http/Controllers/OrderController.php

    public function index()
    {
    	$order = Order::where('user_id',auth()->user()->id)->get();
---
select * from `orders` where `user_id` = '3'

     public function store(Request $request)
    {

            $order = New Order;
    		$order->buyer_name = Auth()->user()->name;
    		$order->product_name = request('product_name');
    		$order->user_id = Auth()->user()->id;
    		$order->total = request('harga');
            $order->save();
---
insert into `orders` (`buyer_name`, `product_name`, `user_id`, `total`, `updated_at`, `created_at`) values ('Muhammad Fatichul Ichsan', 'Vans On0', '1', '500000', '2018-11-02 08:41:02', '2018-11-02 08:41:02')