app/Http/Controllers/ProductController.php

select `categories`.*, `products`.*, `photos`.* from `photos` inner join `products` on `photos`.`product_id` = `products`.`id` inner join `categories` on `products`.`category_id` = `categories`.`id` where `slug` = 'vans-on0-b1mur' limit 1
---
    public function show($id)
    {
        $product = DB::table('photos')
                    ->join('products','photos.product_id','=','products.id')
                    ->join('categories','products.category_id','=','categories.id')
                    ->select('categories.*','products.*','photos.*')
                    ->where('slug',$id)
                    ->first();